cask_args appdir: "/Applications"

cask "google-chrome"
cask "visual-studio-code"
cask "android-studio"
cask "docker"
cask "virtualbox"
cask "robo-3t"
cask "stoplight-studio"
cask "slack"
cask "vlc"
cask "deepl"
cask "clipy"

brew "asdf"
brew "ansible"
brew "cask"
brew "docker", link: false
brew "docker-compose", link: false
brew "jq"
brew "starship"
brew "tree"
brew "yq"
brew "stow"

cask "android-studio"
cask "arc"
cask "bitwarden"
cask "chromedriver"
cask "deepl"
cask "discord"
cask "figma"
cask "gimp"
cask "google-chrome"
cask "google-earth-pro"
cask "inkscape"
cask "insomnia"
cask "keka"
cask "microsoft-edge"
cask "microsoft-remote-desktop"
cask "microsoft-teams"
cask "notion"
cask "obsidian"
cask "raycast"
cask "readdle-spark"
cask "rectangle"
cask "robo-3t"
cask "slack"
cask "staruml"
cask "stoplight-studio"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "zoom"

vscode "42Crunch.vscode-openapi"
vscode "alefragnani.project-manager"
vscode "Arjun.swagger-viewer"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "crisward.riot-tag"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "Equinusocio.vsc-community-material-theme"
vscode "Equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "felixfbecker.php-intellisense"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "gerane.Theme-Riot"
vscode "GitHub.vscode-pull-request-github"
vscode "GrapeCity.gc-excelviewer"
vscode "hediet.vscode-drawio"
vscode "ionutvmi.path-autocomplete"
vscode "jebbs.plantuml"
vscode "kevinkyang.auto-comment-blocks"
vscode "kisstkondoros.vscode-codemetrics"
vscode "mhutchie.git-graph"
vscode "mosapride.zenkaku"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "neilbrayfield.php-docblocker"
vscode "oderwat.indent-rainbow"
vscode "Orta.vscode-jest"
vscode "PKief.material-icon-theme"
vscode "rangav.vscode-thunder-client"
vscode "rbbit.typescript-hero"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "stevencl.addDocComments"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "tht13.html-preview-vscode"
vscode "tomoki1207.pdf"
vscode "vincaslt.highlight-matching-tag"
vscode "Vue.volar"
vscode "whatwedo.twig"
vscode "wix.vscode-import-cost"
vscode "wraith13.zoombar-vscode"
vscode "xabikos.JavaScriptSnippets"
vscode "yoshinorin.current-file-path"
vscode "zenclabs.previewjs"
