tap "goodwithtech/r"
tap "grishka/grishka"
tap "homebrew/bundle"
brew "openssl@3"
brew "libyaml"
brew "readline"
brew "ansible"
brew "gmp"
brew "cask"
brew "cocoapods"
brew "docker", link: false
brew "ffmpeg"
brew "gh"
brew "gnupg"
brew "jq"
brew "jsonnet"
brew "k6"
brew "mise"
brew "nushell"
brew "postgresql@14"
brew "qrencode"
brew "rover"
brew "starship"
brew "stow"
brew "tbls"
brew "tmux"
brew "tree"
brew "uv"
brew "watch"
brew "yq"
brew "goodwithtech/r/dockle"
cask "adobe-creative-cloud"
cask "android-sdk"
cask "android-studio", args: { appdir: "/Applications" }
cask "arc", args: { appdir: "/Applications" }
cask "bitwarden", args: { appdir: "/Applications" }
cask "brave-browser"
cask "chatgpt"
cask "chromedriver", args: { appdir: "/Applications" }
cask "claude"
cask "cursor"
cask "dbeaver-community"
cask "deepl"
cask "discord", args: { appdir: "/Applications" }
cask "docker"
cask "figma", args: { appdir: "/Applications" }
cask "firefox"
cask "google-chrome", args: { appdir: "/Applications" }
cask "google-earth-pro", args: { appdir: "/Applications" }
cask "inkscape", args: { appdir: "/Applications" }
cask "insomnia", args: { appdir: "/Applications" }
cask "keka", args: { appdir: "/Applications" }
cask "microsoft-auto-update"
cask "microsoft-edge", args: { appdir: "/Applications" }
cask "microsoft-office", args: { appdir: "/Applications" }
cask "microsoft-remote-desktop"
cask "microsoft-teams@classic"
cask "notion", args: { appdir: "/Applications" }
cask "obsidian", args: { appdir: "/Applications" }
cask "orbstack"
cask "raycast", args: { appdir: "/Applications" }
cask "rectangle", args: { appdir: "/Applications" }
cask "slack", args: { appdir: "/Applications" }
cask "stoplight-studio", args: { appdir: "/Applications" }
cask "studio-3t"
cask "utm"
cask "vagrant", args: { appdir: "/Applications" }
cask "visual-studio-code", args: { appdir: "/Applications" }
cask "vlc", args: { appdir: "/Applications" }
cask "warp", args: { appdir: "/Applications" }
cask "zoom", args: { appdir: "/Applications" }
vscode "42crunch.vscode-openapi"
vscode "4ops.terraform"
vscode "alefragnani.project-manager"
vscode "arjun.swagger-viewer"
vscode "biomejs.biome"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "crisward.riot-tag"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "exiasr.hadolint"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "gerane.theme-riot"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "grafana.vscode-jsonnet"
vscode "grapecity.gc-excelviewer"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "ionutvmi.path-autocomplete"
vscode "jebbs.plantuml"
vscode "jetpack-io.devbox"
vscode "kevinkyang.auto-comment-blocks"
vscode "kisstkondoros.vscode-codemetrics"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "neilbrayfield.php-docblocker"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "redocly.openapi-vs-code"
vscode "ritwickdey.liveserver"
vscode "saoudrizwan.claude-dev"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "tomoki1207.pdf"
vscode "unifiedjs.vscode-mdx"
vscode "vincaslt.highlight-matching-tag"
vscode "vitest.explorer"
vscode "wayou.vscode-todo-highlight"
vscode "whatwedo.twig"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
