cask_args appdir: "/Applications"

brew "asdf"
brew "imagemagick"

cask "alacritty"
cask "google-chrome"
cask "visual-studio-code"
cask "android-studio"
cask "sourcetree"
cask "docker"
cask "virtualbox"
cask "robo-3t"
cask "stoplight-studio"
cask "slack"
cask "vlc"
cask "alfred"
cask "deepl"
cask "clipy"
